cavity/0/Force
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Force;
}

dimensions      [1 1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    fixedWalls
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}