cavity/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Cavity;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Cavity-Mesh;
    patches           (movingWall);
    locations         faceCenters;
    
    readData
    (
      Stress
    );
    
    writeData
    (
      Force
    );
  };
};

FSI
{
  rho           rho [1 -3 0 0 0 0 0] 1.0;
  nu            nu [0 2 -1 0 0 0 0] 0.01;
}